---
kind: type
id: T:Autodesk.Revit.DB.ElementArrayIterator
source: html/fc1af4a8-d97f-da4e-97bd-d97061977360.htm
---
# Autodesk.Revit.DB.ElementArrayIterator

An iterator to an element array.

## Syntax (C#)
```csharp
public abstract class ElementArrayIterator : APIObject,
	IEnumerator
```